# Задание 5

# Дана строка.Замените в этой строке все цифры 1 на слово one.

my_str = "1213141516171819101"
print(my_str.replace('1', 'one'))
