# Задание 6

# Дана строка.Удалите из этой строки все символы @.

my_str = "@W@E@E@E@R"
print(my_str.replace('@', ''))
